{
  "_class_name": "AutoencoderKLFlux2",
  "_diffusers_version": "0.37.0.dev0",
  "_name_or_path": "black-forest-labs/FLUX.2-dev",
  "act_fn": "silu",
  "batch_norm_eps": 0.0001,
  "batch_norm_momentum": 0.1,
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": true,
  "in_channels": 3,
  "latent_channels": 32,
  "layers_per_block": 2,
  "mid_block_add_attention": true,
  "norm_num_groups": 32,
  "out_channels": 3,
  "patch_size": [
    2,
    2
  ],
  "sample_size": 1024,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "use_post_quant_conv": true,
  "use_quant_conv": true
}
