{
  "metadata": {
    "quantization_level": "8",
    "mflux_version": "0.17.5"
  },
  "weight_map": {
    "encoder.conv_in.weight": "0.safetensors",
    "encoder.conv_in.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.norm1.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.norm1.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.conv1.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.conv1.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.norm2.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.norm2.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.conv2.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.0.conv2.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.norm1.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.norm1.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.conv1.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.conv1.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.norm2.bias": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.norm2.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.conv2.weight": "0.safetensors",
    "encoder.down_blocks.0.resnets.1.conv2.bias": "0.safetensors",
    "encoder.down_blocks.0.downsamplers.0.conv.weight": "0.safetensors",
    "encoder.down_blocks.0.downsamplers.0.conv.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.norm1.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.norm1.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv1.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv1.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.norm2.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.norm2.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv2.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv2.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv_shortcut.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.0.conv_shortcut.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.norm1.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.norm1.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.conv1.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.conv1.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.norm2.bias": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.norm2.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.conv2.weight": "0.safetensors",
    "encoder.down_blocks.1.resnets.1.conv2.bias": "0.safetensors",
    "encoder.down_blocks.1.downsamplers.0.conv.weight": "0.safetensors",
    "encoder.down_blocks.1.downsamplers.0.conv.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.norm1.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.norm1.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv1.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv1.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.norm2.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.norm2.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv2.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv2.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv_shortcut.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.0.conv_shortcut.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.norm1.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.norm1.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.conv1.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.conv1.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.norm2.bias": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.norm2.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.conv2.weight": "0.safetensors",
    "encoder.down_blocks.2.resnets.1.conv2.bias": "0.safetensors",
    "encoder.down_blocks.2.downsamplers.0.conv.weight": "0.safetensors",
    "encoder.down_blocks.2.downsamplers.0.conv.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.norm1.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.norm1.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.conv1.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.conv1.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.norm2.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.norm2.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.conv2.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.0.conv2.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.norm1.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.norm1.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.conv1.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.conv1.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.norm2.bias": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.norm2.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.conv2.weight": "0.safetensors",
    "encoder.down_blocks.3.resnets.1.conv2.bias": "0.safetensors",
    "encoder.mid_block.resnets.0.norm1.bias": "0.safetensors",
    "encoder.mid_block.resnets.0.norm1.weight": "0.safetensors",
    "encoder.mid_block.resnets.0.conv1.weight": "0.safetensors",
    "encoder.mid_block.resnets.0.conv1.bias": "0.safetensors",
    "encoder.mid_block.resnets.0.norm2.bias": "0.safetensors",
    "encoder.mid_block.resnets.0.norm2.weight": "0.safetensors",
    "encoder.mid_block.resnets.0.conv2.weight": "0.safetensors",
    "encoder.mid_block.resnets.0.conv2.bias": "0.safetensors",
    "encoder.mid_block.resnets.1.norm1.bias": "0.safetensors",
    "encoder.mid_block.resnets.1.norm1.weight": "0.safetensors",
    "encoder.mid_block.resnets.1.conv1.weight": "0.safetensors",
    "encoder.mid_block.resnets.1.conv1.bias": "0.safetensors",
    "encoder.mid_block.resnets.1.norm2.bias": "0.safetensors",
    "encoder.mid_block.resnets.1.norm2.weight": "0.safetensors",
    "encoder.mid_block.resnets.1.conv2.weight": "0.safetensors",
    "encoder.mid_block.resnets.1.conv2.bias": "0.safetensors",
    "encoder.mid_block.attentions.0.group_norm.bias": "0.safetensors",
    "encoder.mid_block.attentions.0.group_norm.weight": "0.safetensors",
    "encoder.mid_block.attentions.0.to_q.weight": "0.safetensors",
    "encoder.mid_block.attentions.0.to_q.scales": "0.safetensors",
    "encoder.mid_block.attentions.0.to_q.biases": "0.safetensors",
    "encoder.mid_block.attentions.0.to_q.bias": "0.safetensors",
    "encoder.mid_block.attentions.0.to_k.weight": "0.safetensors",
    "encoder.mid_block.attentions.0.to_k.scales": "0.safetensors",
    "encoder.mid_block.attentions.0.to_k.biases": "0.safetensors",
    "encoder.mid_block.attentions.0.to_k.bias": "0.safetensors",
    "encoder.mid_block.attentions.0.to_v.weight": "0.safetensors",
    "encoder.mid_block.attentions.0.to_v.scales": "0.safetensors",
    "encoder.mid_block.attentions.0.to_v.biases": "0.safetensors",
    "encoder.mid_block.attentions.0.to_v.bias": "0.safetensors",
    "encoder.mid_block.attentions.0.to_out.weight": "0.safetensors",
    "encoder.mid_block.attentions.0.to_out.scales": "0.safetensors",
    "encoder.mid_block.attentions.0.to_out.biases": "0.safetensors",
    "encoder.mid_block.attentions.0.to_out.bias": "0.safetensors",
    "encoder.conv_norm_out.bias": "0.safetensors",
    "encoder.conv_norm_out.weight": "0.safetensors",
    "encoder.conv_out.weight": "0.safetensors",
    "encoder.conv_out.bias": "0.safetensors",
    "decoder.conv_in.weight": "0.safetensors",
    "decoder.conv_in.bias": "0.safetensors",
    "decoder.mid_block.resnets.0.norm1.bias": "0.safetensors",
    "decoder.mid_block.resnets.0.norm1.weight": "0.safetensors",
    "decoder.mid_block.resnets.0.conv1.weight": "0.safetensors",
    "decoder.mid_block.resnets.0.conv1.bias": "0.safetensors",
    "decoder.mid_block.resnets.0.norm2.bias": "0.safetensors",
    "decoder.mid_block.resnets.0.norm2.weight": "0.safetensors",
    "decoder.mid_block.resnets.0.conv2.weight": "0.safetensors",
    "decoder.mid_block.resnets.0.conv2.bias": "0.safetensors",
    "decoder.mid_block.resnets.1.norm1.bias": "0.safetensors",
    "decoder.mid_block.resnets.1.norm1.weight": "0.safetensors",
    "decoder.mid_block.resnets.1.conv1.weight": "0.safetensors",
    "decoder.mid_block.resnets.1.conv1.bias": "0.safetensors",
    "decoder.mid_block.resnets.1.norm2.bias": "0.safetensors",
    "decoder.mid_block.resnets.1.norm2.weight": "0.safetensors",
    "decoder.mid_block.resnets.1.conv2.weight": "0.safetensors",
    "decoder.mid_block.resnets.1.conv2.bias": "0.safetensors",
    "decoder.mid_block.attentions.0.group_norm.bias": "0.safetensors",
    "decoder.mid_block.attentions.0.group_norm.weight": "0.safetensors",
    "decoder.mid_block.attentions.0.to_q.weight": "0.safetensors",
    "decoder.mid_block.attentions.0.to_q.scales": "0.safetensors",
    "decoder.mid_block.attentions.0.to_q.biases": "0.safetensors",
    "decoder.mid_block.attentions.0.to_q.bias": "0.safetensors",
    "decoder.mid_block.attentions.0.to_k.weight": "0.safetensors",
    "decoder.mid_block.attentions.0.to_k.scales": "0.safetensors",
    "decoder.mid_block.attentions.0.to_k.biases": "0.safetensors",
    "decoder.mid_block.attentions.0.to_k.bias": "0.safetensors",
    "decoder.mid_block.attentions.0.to_v.weight": "0.safetensors",
    "decoder.mid_block.attentions.0.to_v.scales": "0.safetensors",
    "decoder.mid_block.attentions.0.to_v.biases": "0.safetensors",
    "decoder.mid_block.attentions.0.to_v.bias": "0.safetensors",
    "decoder.mid_block.attentions.0.to_out.weight": "0.safetensors",
    "decoder.mid_block.attentions.0.to_out.scales": "0.safetensors",
    "decoder.mid_block.attentions.0.to_out.biases": "0.safetensors",
    "decoder.mid_block.attentions.0.to_out.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.norm1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.norm1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.conv1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.conv1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.norm2.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.norm2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.conv2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.0.conv2.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.norm1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.norm1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.conv1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.conv1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.norm2.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.norm2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.conv2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.1.conv2.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.norm1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.norm1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.conv1.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.conv1.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.norm2.bias": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.norm2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.conv2.weight": "0.safetensors",
    "decoder.up_blocks.0.resnets.2.conv2.bias": "0.safetensors",
    "decoder.up_blocks.0.upsamplers.0.conv.weight": "0.safetensors",
    "decoder.up_blocks.0.upsamplers.0.conv.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.norm1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.norm1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.conv1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.conv1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.norm2.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.norm2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.conv2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.0.conv2.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.norm1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.norm1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.conv1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.conv1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.norm2.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.norm2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.conv2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.1.conv2.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.norm1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.norm1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.conv1.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.conv1.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.norm2.bias": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.norm2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.conv2.weight": "0.safetensors",
    "decoder.up_blocks.1.resnets.2.conv2.bias": "0.safetensors",
    "decoder.up_blocks.1.upsamplers.0.conv.weight": "0.safetensors",
    "decoder.up_blocks.1.upsamplers.0.conv.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.norm1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.norm1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.norm2.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.norm2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv2.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv_shortcut.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.0.conv_shortcut.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.norm1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.norm1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.conv1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.conv1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.norm2.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.norm2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.conv2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.1.conv2.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.norm1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.norm1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.conv1.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.conv1.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.norm2.bias": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.norm2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.conv2.weight": "0.safetensors",
    "decoder.up_blocks.2.resnets.2.conv2.bias": "0.safetensors",
    "decoder.up_blocks.2.upsamplers.0.conv.weight": "0.safetensors",
    "decoder.up_blocks.2.upsamplers.0.conv.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.norm1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.norm1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.norm2.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.norm2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv2.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv_shortcut.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.0.conv_shortcut.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.norm1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.norm1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.conv1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.conv1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.norm2.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.norm2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.conv2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.1.conv2.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.norm1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.norm1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.conv1.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.conv1.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.norm2.bias": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.norm2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.conv2.weight": "0.safetensors",
    "decoder.up_blocks.3.resnets.2.conv2.bias": "0.safetensors",
    "decoder.conv_norm_out.bias": "0.safetensors",
    "decoder.conv_norm_out.weight": "0.safetensors",
    "decoder.conv_out.weight": "0.safetensors",
    "decoder.conv_out.bias": "0.safetensors",
    "quant_conv.weight": "0.safetensors",
    "quant_conv.bias": "0.safetensors",
    "post_quant_conv.weight": "0.safetensors",
    "post_quant_conv.bias": "0.safetensors",
    "bn.running_mean": "0.safetensors",
    "bn.running_var": "0.safetensors"
  }
}