{
  "metadata": {
    "quantization_level": "8",
    "mflux_version": "0.17.5"
  },
  "weight_map": {
    "time_guidance_embed.linear_1.weight": "0.safetensors",
    "time_guidance_embed.linear_1.scales": "0.safetensors",
    "time_guidance_embed.linear_1.biases": "0.safetensors",
    "time_guidance_embed.linear_2.weight": "0.safetensors",
    "time_guidance_embed.linear_2.scales": "0.safetensors",
    "time_guidance_embed.linear_2.biases": "0.safetensors",
    "double_stream_modulation_img.linear.weight": "0.safetensors",
    "double_stream_modulation_img.linear.scales": "0.safetensors",
    "double_stream_modulation_img.linear.biases": "0.safetensors",
    "double_stream_modulation_txt.linear.weight": "0.safetensors",
    "double_stream_modulation_txt.linear.scales": "0.safetensors",
    "double_stream_modulation_txt.linear.biases": "0.safetensors",
    "single_stream_modulation.linear.weight": "0.safetensors",
    "single_stream_modulation.linear.scales": "0.safetensors",
    "single_stream_modulation.linear.biases": "0.safetensors",
    "x_embedder.weight": "0.safetensors",
    "x_embedder.scales": "0.safetensors",
    "x_embedder.biases": "0.safetensors",
    "context_embedder.weight": "0.safetensors",
    "context_embedder.scales": "0.safetensors",
    "context_embedder.biases": "0.safetensors",
    "transformer_blocks.0.attn.to_q.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_q.scales": "0.safetensors",
    "transformer_blocks.0.attn.to_q.biases": "0.safetensors",
    "transformer_blocks.0.attn.to_k.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_k.scales": "0.safetensors",
    "transformer_blocks.0.attn.to_k.biases": "0.safetensors",
    "transformer_blocks.0.attn.to_v.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_v.scales": "0.safetensors",
    "transformer_blocks.0.attn.to_v.biases": "0.safetensors",
    "transformer_blocks.0.attn.norm_q.weight": "0.safetensors",
    "transformer_blocks.0.attn.norm_k.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_out.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_out.scales": "0.safetensors",
    "transformer_blocks.0.attn.to_out.biases": "0.safetensors",
    "transformer_blocks.0.attn.norm_added_q.weight": "0.safetensors",
    "transformer_blocks.0.attn.norm_added_k.weight": "0.safetensors",
    "transformer_blocks.0.attn.add_q_proj.weight": "0.safetensors",
    "transformer_blocks.0.attn.add_q_proj.scales": "0.safetensors",
    "transformer_blocks.0.attn.add_q_proj.biases": "0.safetensors",
    "transformer_blocks.0.attn.add_k_proj.weight": "0.safetensors",
    "transformer_blocks.0.attn.add_k_proj.scales": "0.safetensors",
    "transformer_blocks.0.attn.add_k_proj.biases": "0.safetensors",
    "transformer_blocks.0.attn.add_v_proj.weight": "0.safetensors",
    "transformer_blocks.0.attn.add_v_proj.scales": "0.safetensors",
    "transformer_blocks.0.attn.add_v_proj.biases": "0.safetensors",
    "transformer_blocks.0.attn.to_add_out.weight": "0.safetensors",
    "transformer_blocks.0.attn.to_add_out.scales": "0.safetensors",
    "transformer_blocks.0.attn.to_add_out.biases": "0.safetensors",
    "transformer_blocks.0.ff.linear_in.weight": "0.safetensors",
    "transformer_blocks.0.ff.linear_in.scales": "0.safetensors",
    "transformer_blocks.0.ff.linear_in.biases": "0.safetensors",
    "transformer_blocks.0.ff.linear_out.weight": "0.safetensors",
    "transformer_blocks.0.ff.linear_out.scales": "0.safetensors",
    "transformer_blocks.0.ff.linear_out.biases": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_in.weight": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_in.scales": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_in.biases": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_out.weight": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_out.scales": "0.safetensors",
    "transformer_blocks.0.ff_context.linear_out.biases": "0.safetensors",
    "transformer_blocks.1.attn.to_q.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_q.scales": "0.safetensors",
    "transformer_blocks.1.attn.to_q.biases": "0.safetensors",
    "transformer_blocks.1.attn.to_k.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_k.scales": "0.safetensors",
    "transformer_blocks.1.attn.to_k.biases": "0.safetensors",
    "transformer_blocks.1.attn.to_v.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_v.scales": "0.safetensors",
    "transformer_blocks.1.attn.to_v.biases": "0.safetensors",
    "transformer_blocks.1.attn.norm_q.weight": "0.safetensors",
    "transformer_blocks.1.attn.norm_k.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_out.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_out.scales": "0.safetensors",
    "transformer_blocks.1.attn.to_out.biases": "0.safetensors",
    "transformer_blocks.1.attn.norm_added_q.weight": "0.safetensors",
    "transformer_blocks.1.attn.norm_added_k.weight": "0.safetensors",
    "transformer_blocks.1.attn.add_q_proj.weight": "0.safetensors",
    "transformer_blocks.1.attn.add_q_proj.scales": "0.safetensors",
    "transformer_blocks.1.attn.add_q_proj.biases": "0.safetensors",
    "transformer_blocks.1.attn.add_k_proj.weight": "0.safetensors",
    "transformer_blocks.1.attn.add_k_proj.scales": "0.safetensors",
    "transformer_blocks.1.attn.add_k_proj.biases": "0.safetensors",
    "transformer_blocks.1.attn.add_v_proj.weight": "0.safetensors",
    "transformer_blocks.1.attn.add_v_proj.scales": "0.safetensors",
    "transformer_blocks.1.attn.add_v_proj.biases": "0.safetensors",
    "transformer_blocks.1.attn.to_add_out.weight": "0.safetensors",
    "transformer_blocks.1.attn.to_add_out.scales": "0.safetensors",
    "transformer_blocks.1.attn.to_add_out.biases": "0.safetensors",
    "transformer_blocks.1.ff.linear_in.weight": "0.safetensors",
    "transformer_blocks.1.ff.linear_in.scales": "0.safetensors",
    "transformer_blocks.1.ff.linear_in.biases": "0.safetensors",
    "transformer_blocks.1.ff.linear_out.weight": "0.safetensors",
    "transformer_blocks.1.ff.linear_out.scales": "0.safetensors",
    "transformer_blocks.1.ff.linear_out.biases": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_in.weight": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_in.scales": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_in.biases": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_out.weight": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_out.scales": "0.safetensors",
    "transformer_blocks.1.ff_context.linear_out.biases": "0.safetensors",
    "transformer_blocks.2.attn.to_q.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_q.scales": "0.safetensors",
    "transformer_blocks.2.attn.to_q.biases": "0.safetensors",
    "transformer_blocks.2.attn.to_k.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_k.scales": "0.safetensors",
    "transformer_blocks.2.attn.to_k.biases": "0.safetensors",
    "transformer_blocks.2.attn.to_v.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_v.scales": "0.safetensors",
    "transformer_blocks.2.attn.to_v.biases": "0.safetensors",
    "transformer_blocks.2.attn.norm_q.weight": "0.safetensors",
    "transformer_blocks.2.attn.norm_k.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_out.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_out.scales": "0.safetensors",
    "transformer_blocks.2.attn.to_out.biases": "0.safetensors",
    "transformer_blocks.2.attn.norm_added_q.weight": "0.safetensors",
    "transformer_blocks.2.attn.norm_added_k.weight": "0.safetensors",
    "transformer_blocks.2.attn.add_q_proj.weight": "0.safetensors",
    "transformer_blocks.2.attn.add_q_proj.scales": "0.safetensors",
    "transformer_blocks.2.attn.add_q_proj.biases": "0.safetensors",
    "transformer_blocks.2.attn.add_k_proj.weight": "0.safetensors",
    "transformer_blocks.2.attn.add_k_proj.scales": "0.safetensors",
    "transformer_blocks.2.attn.add_k_proj.biases": "0.safetensors",
    "transformer_blocks.2.attn.add_v_proj.weight": "0.safetensors",
    "transformer_blocks.2.attn.add_v_proj.scales": "0.safetensors",
    "transformer_blocks.2.attn.add_v_proj.biases": "0.safetensors",
    "transformer_blocks.2.attn.to_add_out.weight": "0.safetensors",
    "transformer_blocks.2.attn.to_add_out.scales": "0.safetensors",
    "transformer_blocks.2.attn.to_add_out.biases": "0.safetensors",
    "transformer_blocks.2.ff.linear_in.weight": "0.safetensors",
    "transformer_blocks.2.ff.linear_in.scales": "0.safetensors",
    "transformer_blocks.2.ff.linear_in.biases": "0.safetensors",
    "transformer_blocks.2.ff.linear_out.weight": "0.safetensors",
    "transformer_blocks.2.ff.linear_out.scales": "0.safetensors",
    "transformer_blocks.2.ff.linear_out.biases": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_in.weight": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_in.scales": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_in.biases": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_out.weight": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_out.scales": "0.safetensors",
    "transformer_blocks.2.ff_context.linear_out.biases": "0.safetensors",
    "transformer_blocks.3.attn.to_q.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_q.scales": "0.safetensors",
    "transformer_blocks.3.attn.to_q.biases": "0.safetensors",
    "transformer_blocks.3.attn.to_k.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_k.scales": "0.safetensors",
    "transformer_blocks.3.attn.to_k.biases": "0.safetensors",
    "transformer_blocks.3.attn.to_v.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_v.scales": "0.safetensors",
    "transformer_blocks.3.attn.to_v.biases": "0.safetensors",
    "transformer_blocks.3.attn.norm_q.weight": "0.safetensors",
    "transformer_blocks.3.attn.norm_k.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_out.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_out.scales": "0.safetensors",
    "transformer_blocks.3.attn.to_out.biases": "0.safetensors",
    "transformer_blocks.3.attn.norm_added_q.weight": "0.safetensors",
    "transformer_blocks.3.attn.norm_added_k.weight": "0.safetensors",
    "transformer_blocks.3.attn.add_q_proj.weight": "0.safetensors",
    "transformer_blocks.3.attn.add_q_proj.scales": "0.safetensors",
    "transformer_blocks.3.attn.add_q_proj.biases": "0.safetensors",
    "transformer_blocks.3.attn.add_k_proj.weight": "0.safetensors",
    "transformer_blocks.3.attn.add_k_proj.scales": "0.safetensors",
    "transformer_blocks.3.attn.add_k_proj.biases": "0.safetensors",
    "transformer_blocks.3.attn.add_v_proj.weight": "0.safetensors",
    "transformer_blocks.3.attn.add_v_proj.scales": "0.safetensors",
    "transformer_blocks.3.attn.add_v_proj.biases": "0.safetensors",
    "transformer_blocks.3.attn.to_add_out.weight": "0.safetensors",
    "transformer_blocks.3.attn.to_add_out.scales": "0.safetensors",
    "transformer_blocks.3.attn.to_add_out.biases": "0.safetensors",
    "transformer_blocks.3.ff.linear_in.weight": "0.safetensors",
    "transformer_blocks.3.ff.linear_in.scales": "0.safetensors",
    "transformer_blocks.3.ff.linear_in.biases": "0.safetensors",
    "transformer_blocks.3.ff.linear_out.weight": "0.safetensors",
    "transformer_blocks.3.ff.linear_out.scales": "0.safetensors",
    "transformer_blocks.3.ff.linear_out.biases": "0.safetensors",
    "transformer_blocks.3.ff_context.linear_in.weight": "0.safetensors",
    "transformer_blocks.3.ff_context.linear_in.scales": "0.safetensors",
    "transformer_blocks.3.ff_context.linear_in.biases": "0.safetensors",
    "transformer_blocks.3.ff_context.linear_out.weight": "1.safetensors",
    "transformer_blocks.3.ff_context.linear_out.scales": "1.safetensors",
    "transformer_blocks.3.ff_context.linear_out.biases": "1.safetensors",
    "transformer_blocks.4.attn.to_q.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_q.scales": "1.safetensors",
    "transformer_blocks.4.attn.to_q.biases": "1.safetensors",
    "transformer_blocks.4.attn.to_k.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_k.scales": "1.safetensors",
    "transformer_blocks.4.attn.to_k.biases": "1.safetensors",
    "transformer_blocks.4.attn.to_v.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_v.scales": "1.safetensors",
    "transformer_blocks.4.attn.to_v.biases": "1.safetensors",
    "transformer_blocks.4.attn.norm_q.weight": "1.safetensors",
    "transformer_blocks.4.attn.norm_k.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_out.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_out.scales": "1.safetensors",
    "transformer_blocks.4.attn.to_out.biases": "1.safetensors",
    "transformer_blocks.4.attn.norm_added_q.weight": "1.safetensors",
    "transformer_blocks.4.attn.norm_added_k.weight": "1.safetensors",
    "transformer_blocks.4.attn.add_q_proj.weight": "1.safetensors",
    "transformer_blocks.4.attn.add_q_proj.scales": "1.safetensors",
    "transformer_blocks.4.attn.add_q_proj.biases": "1.safetensors",
    "transformer_blocks.4.attn.add_k_proj.weight": "1.safetensors",
    "transformer_blocks.4.attn.add_k_proj.scales": "1.safetensors",
    "transformer_blocks.4.attn.add_k_proj.biases": "1.safetensors",
    "transformer_blocks.4.attn.add_v_proj.weight": "1.safetensors",
    "transformer_blocks.4.attn.add_v_proj.scales": "1.safetensors",
    "transformer_blocks.4.attn.add_v_proj.biases": "1.safetensors",
    "transformer_blocks.4.attn.to_add_out.weight": "1.safetensors",
    "transformer_blocks.4.attn.to_add_out.scales": "1.safetensors",
    "transformer_blocks.4.attn.to_add_out.biases": "1.safetensors",
    "transformer_blocks.4.ff.linear_in.weight": "1.safetensors",
    "transformer_blocks.4.ff.linear_in.scales": "1.safetensors",
    "transformer_blocks.4.ff.linear_in.biases": "1.safetensors",
    "transformer_blocks.4.ff.linear_out.weight": "1.safetensors",
    "transformer_blocks.4.ff.linear_out.scales": "1.safetensors",
    "transformer_blocks.4.ff.linear_out.biases": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_in.weight": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_in.scales": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_in.biases": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_out.weight": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_out.scales": "1.safetensors",
    "transformer_blocks.4.ff_context.linear_out.biases": "1.safetensors",
    "transformer_blocks.5.attn.to_q.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_q.scales": "1.safetensors",
    "transformer_blocks.5.attn.to_q.biases": "1.safetensors",
    "transformer_blocks.5.attn.to_k.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_k.scales": "1.safetensors",
    "transformer_blocks.5.attn.to_k.biases": "1.safetensors",
    "transformer_blocks.5.attn.to_v.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_v.scales": "1.safetensors",
    "transformer_blocks.5.attn.to_v.biases": "1.safetensors",
    "transformer_blocks.5.attn.norm_q.weight": "1.safetensors",
    "transformer_blocks.5.attn.norm_k.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_out.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_out.scales": "1.safetensors",
    "transformer_blocks.5.attn.to_out.biases": "1.safetensors",
    "transformer_blocks.5.attn.norm_added_q.weight": "1.safetensors",
    "transformer_blocks.5.attn.norm_added_k.weight": "1.safetensors",
    "transformer_blocks.5.attn.add_q_proj.weight": "1.safetensors",
    "transformer_blocks.5.attn.add_q_proj.scales": "1.safetensors",
    "transformer_blocks.5.attn.add_q_proj.biases": "1.safetensors",
    "transformer_blocks.5.attn.add_k_proj.weight": "1.safetensors",
    "transformer_blocks.5.attn.add_k_proj.scales": "1.safetensors",
    "transformer_blocks.5.attn.add_k_proj.biases": "1.safetensors",
    "transformer_blocks.5.attn.add_v_proj.weight": "1.safetensors",
    "transformer_blocks.5.attn.add_v_proj.scales": "1.safetensors",
    "transformer_blocks.5.attn.add_v_proj.biases": "1.safetensors",
    "transformer_blocks.5.attn.to_add_out.weight": "1.safetensors",
    "transformer_blocks.5.attn.to_add_out.scales": "1.safetensors",
    "transformer_blocks.5.attn.to_add_out.biases": "1.safetensors",
    "transformer_blocks.5.ff.linear_in.weight": "1.safetensors",
    "transformer_blocks.5.ff.linear_in.scales": "1.safetensors",
    "transformer_blocks.5.ff.linear_in.biases": "1.safetensors",
    "transformer_blocks.5.ff.linear_out.weight": "1.safetensors",
    "transformer_blocks.5.ff.linear_out.scales": "1.safetensors",
    "transformer_blocks.5.ff.linear_out.biases": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_in.weight": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_in.scales": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_in.biases": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_out.weight": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_out.scales": "1.safetensors",
    "transformer_blocks.5.ff_context.linear_out.biases": "1.safetensors",
    "transformer_blocks.6.attn.to_q.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_q.scales": "1.safetensors",
    "transformer_blocks.6.attn.to_q.biases": "1.safetensors",
    "transformer_blocks.6.attn.to_k.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_k.scales": "1.safetensors",
    "transformer_blocks.6.attn.to_k.biases": "1.safetensors",
    "transformer_blocks.6.attn.to_v.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_v.scales": "1.safetensors",
    "transformer_blocks.6.attn.to_v.biases": "1.safetensors",
    "transformer_blocks.6.attn.norm_q.weight": "1.safetensors",
    "transformer_blocks.6.attn.norm_k.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_out.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_out.scales": "1.safetensors",
    "transformer_blocks.6.attn.to_out.biases": "1.safetensors",
    "transformer_blocks.6.attn.norm_added_q.weight": "1.safetensors",
    "transformer_blocks.6.attn.norm_added_k.weight": "1.safetensors",
    "transformer_blocks.6.attn.add_q_proj.weight": "1.safetensors",
    "transformer_blocks.6.attn.add_q_proj.scales": "1.safetensors",
    "transformer_blocks.6.attn.add_q_proj.biases": "1.safetensors",
    "transformer_blocks.6.attn.add_k_proj.weight": "1.safetensors",
    "transformer_blocks.6.attn.add_k_proj.scales": "1.safetensors",
    "transformer_blocks.6.attn.add_k_proj.biases": "1.safetensors",
    "transformer_blocks.6.attn.add_v_proj.weight": "1.safetensors",
    "transformer_blocks.6.attn.add_v_proj.scales": "1.safetensors",
    "transformer_blocks.6.attn.add_v_proj.biases": "1.safetensors",
    "transformer_blocks.6.attn.to_add_out.weight": "1.safetensors",
    "transformer_blocks.6.attn.to_add_out.scales": "1.safetensors",
    "transformer_blocks.6.attn.to_add_out.biases": "1.safetensors",
    "transformer_blocks.6.ff.linear_in.weight": "1.safetensors",
    "transformer_blocks.6.ff.linear_in.scales": "1.safetensors",
    "transformer_blocks.6.ff.linear_in.biases": "1.safetensors",
    "transformer_blocks.6.ff.linear_out.weight": "1.safetensors",
    "transformer_blocks.6.ff.linear_out.scales": "1.safetensors",
    "transformer_blocks.6.ff.linear_out.biases": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_in.weight": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_in.scales": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_in.biases": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_out.weight": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_out.scales": "1.safetensors",
    "transformer_blocks.6.ff_context.linear_out.biases": "1.safetensors",
    "transformer_blocks.7.attn.to_q.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_q.scales": "1.safetensors",
    "transformer_blocks.7.attn.to_q.biases": "1.safetensors",
    "transformer_blocks.7.attn.to_k.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_k.scales": "1.safetensors",
    "transformer_blocks.7.attn.to_k.biases": "1.safetensors",
    "transformer_blocks.7.attn.to_v.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_v.scales": "1.safetensors",
    "transformer_blocks.7.attn.to_v.biases": "1.safetensors",
    "transformer_blocks.7.attn.norm_q.weight": "1.safetensors",
    "transformer_blocks.7.attn.norm_k.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_out.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_out.scales": "1.safetensors",
    "transformer_blocks.7.attn.to_out.biases": "1.safetensors",
    "transformer_blocks.7.attn.norm_added_q.weight": "1.safetensors",
    "transformer_blocks.7.attn.norm_added_k.weight": "1.safetensors",
    "transformer_blocks.7.attn.add_q_proj.weight": "1.safetensors",
    "transformer_blocks.7.attn.add_q_proj.scales": "1.safetensors",
    "transformer_blocks.7.attn.add_q_proj.biases": "1.safetensors",
    "transformer_blocks.7.attn.add_k_proj.weight": "1.safetensors",
    "transformer_blocks.7.attn.add_k_proj.scales": "1.safetensors",
    "transformer_blocks.7.attn.add_k_proj.biases": "1.safetensors",
    "transformer_blocks.7.attn.add_v_proj.weight": "1.safetensors",
    "transformer_blocks.7.attn.add_v_proj.scales": "1.safetensors",
    "transformer_blocks.7.attn.add_v_proj.biases": "1.safetensors",
    "transformer_blocks.7.attn.to_add_out.weight": "1.safetensors",
    "transformer_blocks.7.attn.to_add_out.scales": "1.safetensors",
    "transformer_blocks.7.attn.to_add_out.biases": "1.safetensors",
    "transformer_blocks.7.ff.linear_in.weight": "1.safetensors",
    "transformer_blocks.7.ff.linear_in.scales": "1.safetensors",
    "transformer_blocks.7.ff.linear_in.biases": "1.safetensors",
    "transformer_blocks.7.ff.linear_out.weight": "1.safetensors",
    "transformer_blocks.7.ff.linear_out.scales": "1.safetensors",
    "transformer_blocks.7.ff.linear_out.biases": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_in.weight": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_in.scales": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_in.biases": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_out.weight": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_out.scales": "1.safetensors",
    "transformer_blocks.7.ff_context.linear_out.biases": "1.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight": "1.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.scales": "1.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.biases": "1.safetensors",
    "single_transformer_blocks.0.attn.norm_q.weight": "1.safetensors",
    "single_transformer_blocks.0.attn.norm_k.weight": "1.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight": "1.safetensors",
    "single_transformer_blocks.0.attn.to_out.scales": "1.safetensors",
    "single_transformer_blocks.0.attn.to_out.biases": "1.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.1.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.1.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.1.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.1.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.2.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.2.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.2.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.2.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.3.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.3.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.3.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.3.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.4.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.4.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.4.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.4.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.5.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.5.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.5.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.5.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.5.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.5.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.5.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.5.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.6.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.6.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.6.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.6.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.6.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.6.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.6.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.6.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.7.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.7.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.7.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.7.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.7.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.7.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.7.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.7.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.8.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.8.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.8.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.8.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.8.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.8.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.8.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.8.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.9.attn.to_qkv_mlp_proj.weight": "2.safetensors",
    "single_transformer_blocks.9.attn.to_qkv_mlp_proj.scales": "2.safetensors",
    "single_transformer_blocks.9.attn.to_qkv_mlp_proj.biases": "2.safetensors",
    "single_transformer_blocks.9.attn.norm_q.weight": "2.safetensors",
    "single_transformer_blocks.9.attn.norm_k.weight": "2.safetensors",
    "single_transformer_blocks.9.attn.to_out.weight": "2.safetensors",
    "single_transformer_blocks.9.attn.to_out.scales": "2.safetensors",
    "single_transformer_blocks.9.attn.to_out.biases": "2.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.10.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.10.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.10.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.10.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.11.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.11.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.11.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.11.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.12.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.12.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.12.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.12.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.13.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.13.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.13.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.13.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.14.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.14.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.14.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.14.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.15.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.15.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.15.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.15.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.16.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.16.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.16.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.16.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.17.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.17.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.17.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.17.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight": "3.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.scales": "3.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.biases": "3.safetensors",
    "single_transformer_blocks.18.attn.norm_q.weight": "3.safetensors",
    "single_transformer_blocks.18.attn.norm_k.weight": "3.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight": "3.safetensors",
    "single_transformer_blocks.18.attn.to_out.scales": "3.safetensors",
    "single_transformer_blocks.18.attn.to_out.biases": "3.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight": "4.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.scales": "4.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.biases": "4.safetensors",
    "single_transformer_blocks.19.attn.norm_q.weight": "4.safetensors",
    "single_transformer_blocks.19.attn.norm_k.weight": "4.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight": "4.safetensors",
    "single_transformer_blocks.19.attn.to_out.scales": "4.safetensors",
    "single_transformer_blocks.19.attn.to_out.biases": "4.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight": "4.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.scales": "4.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.biases": "4.safetensors",
    "single_transformer_blocks.20.attn.norm_q.weight": "4.safetensors",
    "single_transformer_blocks.20.attn.norm_k.weight": "4.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight": "4.safetensors",
    "single_transformer_blocks.20.attn.to_out.scales": "4.safetensors",
    "single_transformer_blocks.20.attn.to_out.biases": "4.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight": "4.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.scales": "4.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.biases": "4.safetensors",
    "single_transformer_blocks.21.attn.norm_q.weight": "4.safetensors",
    "single_transformer_blocks.21.attn.norm_k.weight": "4.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight": "4.safetensors",
    "single_transformer_blocks.21.attn.to_out.scales": "4.safetensors",
    "single_transformer_blocks.21.attn.to_out.biases": "4.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight": "4.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.scales": "4.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.biases": "4.safetensors",
    "single_transformer_blocks.22.attn.norm_q.weight": "4.safetensors",
    "single_transformer_blocks.22.attn.norm_k.weight": "4.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight": "4.safetensors",
    "single_transformer_blocks.22.attn.to_out.scales": "4.safetensors",
    "single_transformer_blocks.22.attn.to_out.biases": "4.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight": "4.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.scales": "4.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.biases": "4.safetensors",
    "single_transformer_blocks.23.attn.norm_q.weight": "4.safetensors",
    "single_transformer_blocks.23.attn.norm_k.weight": "4.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight": "4.safetensors",
    "single_transformer_blocks.23.attn.to_out.scales": "4.safetensors",
    "single_transformer_blocks.23.attn.to_out.biases": "4.safetensors",
    "norm_out.linear.weight": "4.safetensors",
    "norm_out.linear.scales": "4.safetensors",
    "norm_out.linear.biases": "4.safetensors",
    "proj_out.weight": "4.safetensors",
    "proj_out.scales": "4.safetensors",
    "proj_out.biases": "4.safetensors"
  }
}