{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.36.0.dev0",
  "_name_or_path": "vae",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "decay": 0.9999,
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": true,
  "in_channels": 3,
  "inv_gamma": 1.0,
  "latent_channels": 16,
  "latents_mean": null,
  "latents_std": null,
  "layers_per_block": 2,
  "mid_block_add_attention": true,
  "min_decay": 0.0,
  "norm_num_groups": 32,
  "optimization_step": 45531,
  "out_channels": 3,
  "power": 0.6666666666666666,
  "sample_size": 1024,
  "scaling_factor": 0.3611,
  "shift_factor": 0.1159,
  "stride": 2,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "update_after_step": 0,
  "use_ema_warmup": false,
  "use_post_quant_conv": false,
  "use_quant_conv": false
}
