{
  "_class_name": "ZImageTransformer2DModel",
  "_diffusers_version": "0.36.0.dev0",
  "all_f_patch_size": [
    1
  ],
  "all_patch_size": [
    2
  ],
  "axes_dims": [
    32,
    48,
    48
  ],
  "axes_lens": [
    1536,
    512,
    512
  ],
  "cap_feat_dim": 2560,
  "dim": 3840,
  "in_channels": 16,
  "n_heads": 30,
  "n_kv_heads": 30,
  "n_layers": 30,
  "n_refiner_layers": 2,
  "norm_eps": 1e-05,
  "qk_norm": true,
  "rope_theta": 256.0,
  "t_scale": 1000.0,
  "nheads": 30
}