{
  "_class_name": "Flux2Transformer2DModel",
  "_diffusers_version": "0.37.0.dev0",
  "_name_or_path": "/raid/yiyi/klein-9b-distilled-diffusers/transformer",
  "attention_head_dim": 128,
  "axes_dims_rope": [
    32,
    32,
    32,
    32
  ],
  "eps": 1e-06,
  "guidance_embeds": false,
  "in_channels": 128,
  "joint_attention_dim": 12288,
  "mlp_ratio": 3.0,
  "num_attention_heads": 32,
  "num_layers": 8,
  "num_single_layers": 24,
  "out_channels": null,
  "patch_size": 1,
  "rope_theta": 2000,
  "timestep_guidance_channels": 256
}
